Revit 2027 API
MacroManagerIterator.Current Property
Gets the item at the current position of the iterator.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual MacroModule Current { get; }
Public Overridable ReadOnly Property Current As MacroModule
	Get
public:
virtual property MacroModule^ Current {
	MacroModule^ get ();
}
abstract Current : MacroModule with get
override Current : MacroModule with get
Property Value
MacroModule
Implements
IEnumerator<T>.Current
Exceptions
Exception | Condition
InvalidOperationException |  There is no current item in the iterator.
Remarks
There is no current item if the iterator has not started yet or has been done.
See Also
Reference
MacroManagerIterator Class
Autodesk.Revit.DB.Macros Namespace